In [2]:
import pandas as pd
import numpy as np

In [3]:
# reindex
df = pd.DataFrame(np.arange(9).reshape((3,3)) , columns=["Ohio" , "Utah" , "Colorado"] , index=["a","b","c"])
df

   Ohio  Utah  Colorado
a     0     1         2
b     3     4         5
c     6     7         8

In [4]:
df.reindex(index = ["c" , "v" ,"a","b"] , columns=["Utah"])

   Utah
c   7.0
v   NaN
a   1.0
b   4.0

In [5]:
# Dropping
obj = pd.Series(["Ohio" , "Colorado" , "Success"])
obj

0        Ohio
1    Colorado
2     Success
dtype: object

In [6]:
obj.drop(2)

0        Ohio
1    Colorado
dtype: object

In [7]:
# Dataframe eether axis deletion
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
# from row labels / index axis = 0
data.drop(["Utah" , "New York" ])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [9]:
# axis 1 
data.drop(["two" , "three"] , axis=1)

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [10]:
# inplace param in drop
obj.index = ["a" , "b" , "c"]
obj

a        Ohio
b    Colorado
c     Success
dtype: object

In [11]:
# inclusive slicing
obj['b':'c']

b    Colorado
c     Success
dtype: object

In [12]:
# iloc and loc -> single row/col then series kinda disp
data.loc["Utah" , ["three", "four"]]

three    10
four     11
Name: Utah, dtype: int32

In [13]:
data.iloc[[2,1] , [3,0]]

          four  one
Utah        11    8
Colorado     7    4

In [14]:
# slicing and locs, ilocs , string slice inclusive
data.loc[:'Utah' , 'three':]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11

In [15]:
data.loc[:,"four"]

Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int32

In [17]:
# integer indexing
# -ve indexing not supported in series with int indexes coz of ambiguity but supported with labels
obj = pd.Series(np.arange(4.0))
obj

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [19]:
# obj[-1] #lmao
obj.index = list("abcd")
print(obj)
obj[-1]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

C:\Users\user\AppData\Local\Temp\ipykernel_11588\3692534396.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[-1]

3.0

In [20]:
obj[:1]

a    0.0
dtype: float64

In [21]:
# applying funcs
df4 = pd.DataFrame(np.random.randn(3,4))
df4

          0         1         2         3
0  0.076334 -1.728432 -1.582956 -0.663112
1 -1.025941  1.918870 -1.292110  1.281888
2  1.360932  0.436105 -0.212030  0.524961

In [22]:
np.exp(df4)

          0         1         2         3
0  1.079323  0.177563  0.205367  0.515245
1  0.358459  6.813258  0.274691  3.603435
2  3.899825  1.546671  0.808940  1.690394

In [24]:
# again opp 0 > colwise, 1 rowise
df4.index = ["Ohio" , "Colorado" , "Utah"  ]
df4.columns = ["one" ,"two" , "three" , "four"]
df4

               one       two     three      four
Ohio      0.076334 -1.728432 -1.582956 -0.663112
Colorado -1.025941  1.918870 -1.292110  1.281888
Utah      1.360932  0.436105 -0.212030  0.524961

In [25]:
f = lambda x : x.max() - x.min()
# 1-D arrays
# rowise
print(df4.apply(f, axis="columns"))
# colwise 
print(df4.apply(f, axis="rows"))

Ohio        1.804766
Colorado    3.210981
Utah        1.572962
dtype: float64
one      2.386872
two      3.647303
three    1.370926
four     1.945000
dtype: float64

In [28]:
# applymap for elementwise python funcs , deprecated
# df4.applymap(lambda x: f"{x:.3f}")
# use .map 
df4.map(lambda x: f"{x:.3f}")

             one     two   three    four
Ohio       0.076  -1.728  -1.583  -0.663
Colorado  -1.026   1.919  -1.292   1.282
Utah       1.361   0.436  -0.212   0.525

In [29]:
# Sorting indexes
#  .sort_index(axis, ascending=True)

#val sort 
#  : sort_values for vals in series
#  sort_values(by= [ col list])

df4.sort_index(axis=0)

               one       two     three      four
Colorado -1.025941  1.918870 -1.292110  1.281888
Ohio      0.076334 -1.728432 -1.582956 -0.663112
Utah      1.360932  0.436105 -0.212030  0.524961

In [30]:
df4.sort_values(by=["one"])

               one       two     three      four
Colorado -1.025941  1.918870 -1.292110  1.281888
Ohio      0.076334 -1.728432 -1.582956 -0.663112
Utah      1.360932  0.436105 -0.212030  0.524961

In [31]:
# ranks in df by opposite again
df4.rank(axis="columns")

          one  two  three  four
Ohio      4.0  1.0    2.0   3.0
Colorado  2.0  4.0    1.0   3.0
Utah      4.0  2.0    1.0   3.0

In [32]:
# labels in series or rownames in df same then getting that returns series or df for dup label 
df5 = pd.DataFrame(np.random.randn(3,3) , index=["a","a","b"])
df5

          0         1         2
a  0.122307 -0.255211  0.010211
a -0.051444  1.109427  0.353058
b -1.742297 -0.198436 -3.256960

In [33]:
df5.loc["a"]

          0         1         2
a  0.122307 -0.255211  0.010211
a -0.051444  1.109427  0.353058

In [35]:
df5.loc["b"]

0   -1.742297
1   -0.198436
2   -3.256960
Name: b, dtype: float64